load-test/artillery.yml
config:
  target: http://localhost:8010
  phases:
    - duration: 30
      arrivalRate: 100
      name: Warm up
  payload:
    path: MOCK_DATA.csv
    fields:
      - start_lat
      - start_long
      - end_lat
      - end_long
      - rider_name
      - driver_name
      - driver_vehicle

scenarios:
  - name: Create, list and get rides
    flow:
      - post:
          url: /rides
          json:
            start_lat: "{{ start_lat }}"
            start_long: "{{ start_long }}"
            end_lat: "{{ end_lat }}"
            end_long: "{{ end_long }}"
            rider_name: "{{ rider_name }}"
            driver_name: "{{ driver_name }}"
            driver_vehicle: "{{ driver_vehicle }}"
          capture:
            json: "$[0].rideID"
            as: "id"

      - get:
          url: /rides

      - get:
          url: "/rides/{{ id }}"